package com.onightperson.hearken.viewworkprinciple.news.utils;

/**
 * Created by liubaozhu on 17/1/10.
 */

public class NewsUtils {

    //hard code
    public static String[] getTitles() {
        return new String[] {
                "蔡英文会见奥尔特加台媒不知 李大维：连我们事前也没掌握",
                "习近平讲话传递哪些从严治党新信号"
        };
    }

    public static String[] getContents() {
        return new String[] {
                "【环球网综合报道】据台湾“中时电子报”1月10日报道，正在中美洲'友邦'进行访问的台湾地区领导人蔡英文与当地时间9日与尼加拉瓜总统奥尔特加进行会晤。然而，台湾随行媒体却被摆了一道，还是刚好'看电视才知道'。媒体在下个行程追问台当局涉外部门负责人李大维。对此，李大维表示，连台当局驻尼加拉瓜的“大使馆”事前也没掌握。\n" +
                        "\n" +
                        "　　蔡英文与奥尔特加见面，随行台媒竟是意外看到电视才知道此事，而发现的记者也只是刚好走去吧台拿食物时经过电视看到，连李大维也不知转播一事，显然，蔡英文还是被摆了一道。前任台湾地区领导人马英九任内与奥尔特加见面，也曾差点被放鸽子，而这次蔡英文访问，行程栏上也一直空白，就是“不放心”奥尔特加。\n" +
                        "\n" +
                        "　　对此，李大维说，因为明天是奥尔特加的就职大典，来贺访问团众多，所以事前对会面时间始终无法敲定。台访问团约5点半进入旅馆，6时10分接到电话，6时30分见，谈了1小时45分，相当长的对话。谈话气氛非常愉快，跟前段时间的揣测是完全相反的。\n" +
                        "\n" +
                        "　　至于当地媒体现场直播一事，李大维说，“连我们事前也没掌握，尼加拉瓜今天是就职前一天，整个进行情形比较特殊。”",
                "[学习进行时]十八届中央纪委七次全会1月6日至8日举行，会上，习近平总书记发 表重要讲话，站在时代发展和战略全局的高度，充分肯定全面从严治党取得的显著成效，明确提出今后工作的总体要求和主要任务。新华网“学习进行时”原创品牌 栏目“讲习所”今天推出文章，为您解读习近平这次重要讲话传递的全面从严治党新信号。"
        };
    }
}
